# 1 Введение

<a name="appointment"/>

## 1.1 Назначение
В этом документе описаны функциональные и нефункциональные требования к приложению «RSS-агрегатор новостей» для ОС Windows 10. Этот документ предназначен для команды, которая будет реализовывать и проверять корректность работы приложения. 

<a name="business_requirements"/>

## 1.2 Бизнес-требования

<a name="initial_data"/>

### 1.2.1 Исходные данные
Большинство людей старшей возрастной категории получают актуальную информацию посредством просмотра новостных передач по телевидению, прослушивания их по радио, либо чтения газет. Однако, не все категории информации интересуют каждого человека, поэтому получение новостей такими способами сопряжено с потерей времени на выборку только необходимой информации. В связи с этим многие из представителей данной возрастной категории начинают использовать компьютеры для получения актуальных новостей посредством сети Интернет. Большинсво из них не обладает достаточной технической грамотностью для использования приложений, рассчитанных на продвинутых пользователей. Дополнительные трудности возникают из-за того, что эти приложения зачастую не рассчитаны на использование людьми с плохим зрением. Это приводит к тому, что многие возвращаются к привычным способам получения информации.

<a name="business_opportunities"/>

### 1.2.2 Возможности бизнеса
Многие люди старшей возрастной категории желают иметь приложение, которое позволит получать интересные новости, обладая минимальой технической грамотностью. Подобное приложение позволит им тратить меньше времени на поиск необходимой информации. Интерфейс, спроектированный с учётом всех особенностей данной возрастной категории, и дополнение приложения подробной инструкцией позволят увеличить количество людей, использующих данное приложение.

<a name="project_boundary"/>

### 1.2.3 Границы проекта
Приложение «RSS-агрегатор новостей» позволит зарегистрированным пользователям просматривать краткую информацию о новостях, отобранных согласно их предпочтениям. Для анонимных пользователей предусмотрена возможность просмотра информации о новостях, отобранных с [основных интернет-ресурсов]
